request/UnfSocCrdtNoQry_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:s="http://esb.spdbbiz.com/services/S120030432" xmlns:d="http://esb.spdbbiz.com/metadata" >
	<soap:Header>
		<s:ReqHeader>
			<d:Mac>0000000000000000</d:Mac>
			<d:MacOrgId></d:MacOrgId>
			<d:SourceSysId>0825</d:SourceSysId>
			<d:ConsumerId>0825</d:ConsumerId>
			<d:ServiceAdr>http://esb.spdbbiz.com:7701/services/S120030432</d:ServiceAdr>
			<d:ServiceAction>urn:/UnfSocCrdtNoQry</d:ServiceAction>
			<d:ExtendContent>00</d:ExtendContent>
		</s:ReqHeader>
	</soap:Header>
	<soap:Body>
		<s:ReqUnfSocCrdtNoQry>
			<s:ReqSvcHeader>
				<s:TranDate>20170913</s:TranDate>
				<s:TranTime>162116290</s:TranTime>
				<s:TranTellerNo>00000000</s:TranTellerNo>
				<s:TranSeqNo></s:TranSeqNo>
				<s:ConsumerId>0825</s:ConsumerId>
				<s:GlobalSeqNo>15800001016431580643158064</s:GlobalSeqNo>
				<s:SourceSysId>0825</s:SourceSysId>
				<s:BranchId></s:BranchId>
				<s:TerminalCode>1a</s:TerminalCode>
				<s:CityCode>021</s:CityCode>
				<s:AuthrTellerNo></s:AuthrTellerNo>
				<s:AuthrPwd></s:AuthrPwd>
				<s:AuthrCardFlag></s:AuthrCardFlag>
				<s:AuthrCardNo></s:AuthrCardNo>
				<s:TranCode>DM91</s:TranCode>
				<s:PIN>1234567890123</s:PIN>
				<s:SysOffset1>0000</s:SysOffset1>
				<s:SysOffset2>0000</s:SysOffset2>
				<s:MsgEndFlag>1</s:MsgEndFlag>
				<s:MsgSeqNo>3000</s:MsgSeqNo>
				<s:SubTranCode></s:SubTranCode>
				<s:TranMode></s:TranMode>
				<s:TranSerialNo>0</s:TranSerialNo>
			</s:ReqSvcHeader>
			<s:SvcBody>
				<s:OrgInstId>100000024</s:OrgInstId>
			</s:SvcBody>
		</s:ReqUnfSocCrdtNoQry>
	</soap:Body>
</soap:Envelope>